#include <iostream>
#include <fstream>
using namespace std;  //std - це простір імен  містить багато класів, функцій і об'єктів, які визначені в стандартній бібліотеці і можуть бути використані в програмах C++.

class Logger {
private:
    ofstream logfile_; //відкриття файлу для запису | ofstream - є класом у стандартній бібліотеці
                        //C++ (частинa fstream), який використовується для запису даних у файл.

public:
    Logger(const string& filename) {       //публічний конструктор класу
        logfile_.open(filename, ios::app);//Відкриття файлу для допису\\ios::app дозволяє додавати нові дані в кінець файлу, зберігаючи вже наявний вміст.
    }

    Logger() : logfile_() {} // Конструктор за замовчуванням

    ~Logger() {     //~є деструктором класу Logger
        if (logfile_.is_open()) {//перевіряє чи відкритий для записування даних в файл якщо так то
                                //повертає True і далі закриває файл а далі знищує об'єкт.
            logfile_.close(); // Закриття файлу перед знищенням об'єкта
        }
    }

    void log(const string& message);//ця функція використовується для запису тексту в файл
};
    void check(Logger& logger, int L, int K);//функція яка перевіряє чи правильно ввели число
